In [128]:
import pandas as pd
import numpy as np
df=pd.read_csv(r"V:\Downloads\used_bikes.csv")

In [129]:
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [130]:
df.describe()

              price     kms_driven         age        power
count  1.490000e+02     149.000000  149.000000   149.000000
mean   1.163103e+05   23799.644295    5.469799   261.671141
std    1.729468e+05   34311.863035    2.788870   189.247494
min    1.110000e+04       3.000000    1.000000   100.000000
25%    4.500000e+04    9900.000000    3.000000   150.000000
50%    7.000000e+04   17500.000000    5.000000   200.000000
75%    1.071000e+05   29305.000000    7.000000   350.000000
max    1.350000e+06  357000.000000   16.000000  1299.000000

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 9.4+ KB

In [132]:
decimal_check=np.mod(df['price'], 1).ne(0).any()
if not decimal_check:
    df['price']=df['price'].astype('int32')

In [133]:
decimal_check=np.mod(df['kms_driven'], 1).ne(0).any()
if not decimal_check:
    df['kms_driven']=df['kms_driven'].astype('int32')

In [134]:
decimal_check=np.mod(df['power'], 1).ne(0).any()
if not decimal_check:
    df['power']=df['power'].astype('int16')

In [135]:
decimal_check=np.mod(df['age'], 1).ne(0).any()
if not decimal_check:
    df['age']=df['age'].astype('int8')

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    object
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    object
dtypes: int16(1), int32(2), int8(1), object(4)
memory usage: 6.4+ KB

In [139]:
import mysql.connector
cnx = mysql.connector.connect(
    host='localhost',
    user='root',
    password='VENki97@',
    db='tasks'
)
cursor = cnx.cursor()

In [140]:
cursor.execute("select database();")

In [141]:
record = cursor.fetchone()

In [142]:
print("You're connected to database: ", record)

You're connected to database:  ('tasks',)

In [143]:
cursor.execute("drop table if exists used_bikes")

In [144]:
cursor.execute("create table used_bikes (bike_name varchar(100), price int, city varchar(50), kms_driven int, owner varchar(50), age int, power int, brand varchar(50))")

In [145]:
for i, row in df.iterrows():
    statement = "INSERT INTO used_bikes (bike_name, price, city, kms_driven, owner, age, power, brand) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)"
    val=(row['bike_name'], row['price'], row['city'], row['kms_driven'], row['owner'], row['age'], row['power'], row['brand'])
    cursor.execute(statement, val)

In [146]:
cnx.commit()

In [147]:
cnx.close()

Addtional reducing of space:
- 1- First woner, 2- Second owner, 3- Third owner 
- but changes the datatype to int8

In [148]:
df['owner'].replace('First Owner',1,inplace=True)
df['owner'].replace('Second Owner',2,inplace=True)
df['owner'].replace('Third Owner',3,inplace=True)

In [149]:
decimal_check=np.mod(df['owner'], 1).ne(0).any()
if not decimal_check:
    df['owner']=df['owner'].astype('int8')

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    int8
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    object
dtypes: int16(1), int32(2), int8(2), object(3)
memory usage: 5.4+ KB

Memory reduced to 5.4 kb from 9.4 kb